rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_core.c
// Copyright 2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <sdkconfig.h>
#include <string.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/queue.h>
#include <freertos/event_groups.h>
#include <esp_log.h>
#include <esp_wifi.h>
#include <esp_event.h>
#include <esp_bit_defs.h>

#include <esp_rmaker_factory.h>
#include <esp_rmaker_work_queue.h>
#include <esp_rmaker_common_events.h>
#include <esp_rmaker_utils.h>

#include <esp_rmaker_core.h>
#include <esp_rmaker_user_mapping.h>
#include <esp_rmaker_utils.h>
#include "esp_rmaker_internal.h"
#include "esp_rmaker_mqtt.h"
#include "esp_rmaker_claim.h"
#include "esp_rmaker_client_data.h"

#ifdef CONFIG_OPENTHREAD_ENABLED
#include <esp_openthread.h>
#include <esp_openthread_lock.h>
#include <esp_openthread_dns64.h>
#endif

#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
static const int WIFI_CONNECTED_EVENT = BIT0;
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD)
static const int THREAD_SET_DNS_SEVER_EVENT = BIT0;
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
#include "esp_mac.h"
#endif

static const int MQTT_CONNECTED_EVENT = BIT1;
static EventGroupHandle_t rmaker_core_event_group;

ESP_EVENT_DEFINE_BASE(RMAKER_EVENT);

static const char *TAG = "esp_rmaker_core";


#if defined(CONFIG_ESP_RMAKER_SELF_CLAIM) || defined(CONFIG_ESP_RMAKER_ASSISTED_CLAIM)
#define ESP_RMAKER_CLAIM_ENABLED
#endif

#define ESP_RMAKER_CHECK_HANDLE(rval) \
{ \
    if (!esp_rmaker_priv_data) {\
        ESP_LOGE(TAG, "ESP RainMaker not initialised"); \
        return rval; \
    } \
}

#define ESP_CLAIM_NODE_ID_SIZE  12

/* Handle to maintain internal information (will move to an internal file) */
typedef struct {
    char *node_id;
    const esp_rmaker_node_t *node;
    bool enable_time_sync;
    esp_rmaker_state_t state;
    bool mqtt_connected;
    esp_rmaker_mqtt_conn_params_t *mqtt_conn_params;
#ifdef ESP_RMAKER_CLAIM_ENABLED
    bool need_claim;
    esp_rmaker_claim_data_t *claim_data;
#endif /* ESP_RMAKER_CLAIM_ENABLED */
} esp_rmaker_priv_data_t;

static esp_rmaker_priv_data_t *esp_rmaker_priv_data;

bool esp_rmaker_is_mqtt_connected()
{
    if (esp_rmaker_priv_data) {        
        return esp_rmaker_priv_data->mqtt_connected;
    }
    return false;
}

esp_rmaker_state_t esp_rmaker_get_state(void)
{
    if (esp_rmaker_priv_data) {
        return esp_rmaker_priv_data->state;
    }
    return ESP_RMAKER_STATE_DEINIT;
}

static void reset_event_handler(void* arg, esp_event_base_t event_base,
                          int32_t event_id, void* event_data)
{
        switch (event_id) {
            case RMAKER_EVENT_WIFI_RESET:
                esp_rmaker_mqtt_disconnect();
                break;
            case RMAKER_EVENT_FACTORY_RESET:
                esp_rmaker_reset_user_node_mapping();
                break;
            default:
                break;
        }
}

static void esp_rmaker_mqtt_event_handler(void* arg, esp_event_base_t event_base,
                          int32_t event_id, void* event_data)
{
    if (!esp_rmaker_priv_data) {
        return;
    }
    if (event_base == RMAKER_COMMON_EVENT && event_id == RMAKER_MQTT_EVENT_CONNECTED) {
        esp_rmaker_priv_data->mqtt_connected = true;
    } else if (event_base == RMAKER_COMMON_EVENT && event_id == RMAKER_MQTT_EVENT_DISCONNECTED) {
        esp_rmaker_priv_data->mqtt_connected = false;
    }
}

#ifdef CONFIG_ESP_RMAKER_READ_NODE_ID_FROM_CERT_CN

#include "mbedtls/x509_crt.h"
#include "mbedtls/oid.h"

static char* esp_rmaker_populate_node_id_from_cert()
{ 
    void *addr = NULL;
    size_t len = 0;
    addr = esp_rmaker_get_client_cert();
    if (addr) {
        len = esp_rmaker_get_client_cert_len();
    } else { 
        ESP_LOGE(TAG, "Failed to get device certificate."); 
        return NULL; 
    }
    mbedtls_x509_crt crt;
    mbedtls_x509_crt_init(&crt);
    char *node_id = NULL;
    int ret = mbedtls_x509_crt_parse(&crt, addr, len); 
    if (ret != 0) {
        ESP_LOGE(TAG, "Parsing of device certificate failed, returned %02X", ret); 
    } else {
        mbedtls_asn1_named_data *cn_data;
        cn_data = mbedtls_asn1_find_named_data(&crt.subject, MBEDTLS_OID_AT_CN, 
                                                MBEDTLS_OID_SIZE(MBEDTLS_OID_AT_CN));
        if (cn_data) {
            node_id = MEM_CALLOC_EXTRAM(1, cn_data->val.len + 1);
            memcpy(node_id, (const char *)cn_data->val.p, cn_data->val.len);
        }
    }
    mbedtls_x509_crt_free(&crt); 
    return node_id; 
}
#endif

static char *esp_rmaker_populate_node_id(bool use_claiming)
{
#ifdef CONFIG_ESP_RMAKER_READ_NODE_ID_FROM_CERT_CN
    char *node_id = esp_rmaker_populate_node_id_from_cert();
#else /* !CONFIG_ESP_RMAKER_READ_NODE_ID_FROM_CERT_CN */
    char *node_id = esp_rmaker_factory_get("node_id");
#endif /* CONFIG_ESP_RMAKER_READ_NODE_ID_FROM_CERT_CN */

#ifdef ESP_RMAKER_CLAIM_ENABLED
    if (!node_id && use_claiming) {
        uint8_t mac_addr[6];
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
        /* ESP_MAC_BASE was introduced in ESP-IDF v5.1. It is the same as the Wi-Fi Station MAC address
         * for chips supporting Wi-Fi. We can use base MAC address to generate claim init request for both
         * Wi-Fi and Thread devices
         */
        esp_err_t err = esp_read_mac(mac_addr, ESP_MAC_BASE);
#else
        /* Thread was officially supported in ESP-IDF v5.1. Use Wi-Fi Station MAC address to generate claim
         * init request.
         */
        esp_err_t err = esp_wifi_get_mac(WIFI_IF_STA, mac_addr);
#endif

        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Could not fetch MAC address.");
            return NULL;
        }
        node_id = MEM_CALLOC_EXTRAM(1, ESP_CLAIM_NODE_ID_SIZE + 1); /* +1 for NULL terminatation */
        snprintf(node_id, ESP_CLAIM_NODE_ID_SIZE + 1, "%02X%02X%02X%02X%02X%02X",
                mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
    }
#endif /* ESP_RMAKER_CLAIM_ENABLED */
    return node_id;
}

esp_err_t esp_rmaker_change_node_id(char *node_id, size_t len)
{
    if(esp_rmaker_priv_data) {
        char *new_node_id = strndup(node_id, len);
        if (!new_node_id) {
            ESP_LOGE(TAG, "Failed to allocate %lu bytes for new node_id.", (unsigned long) len);
            return ESP_ERR_NO_MEM;
        }
        if (esp_rmaker_priv_data->node_id) {
            free(esp_rmaker_priv_data->node_id);
        }
        esp_rmaker_priv_data->node_id = new_node_id;
        _esp_rmaker_node_t *node = (_esp_rmaker_node_t *)esp_rmaker_get_node();
        node->node_id = new_node_id;
        ESP_LOGI(TAG, "New Node ID ----- %s", new_node_id);
        return ESP_OK;
    }
    return ESP_ERR_INVALID_STATE;
}


