rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_core.c
/* Event handler for catching system events */
static void esp_rmaker_event_handler(void* arg, esp_event_base_t event_base,
                          int32_t event_id, void* event_data)
{
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
    if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
        if (esp_rmaker_priv_data->claim_data) {
            ESP_LOGE(TAG, "Node connected to Wi-Fi without Assisted claiming. Cannot proceed to MQTT connection.");
            ESP_LOGE(TAG, "Please update your phone apps and repeat Wi-Fi provisioning with BLE transport.");
        }
#endif
        if (rmaker_core_event_group) {
            /* Signal rmaker thread to continue execution */
            xEventGroupSetBits(rmaker_core_event_group, WIFI_CONNECTED_EVENT);
        }
    } else
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD) /* CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI */
    if (event_base == OPENTHREAD_EVENT && event_id == OPENTHREAD_EVENT_SET_DNS_SERVER) {
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
        if (esp_rmaker_priv_data->claim_data) {
            ESP_LOGE(TAG, "Node connected to Thread network without Assisted claiming. Cannot proceed to MQTT connection.");
            ESP_LOGE(TAG, "Please update your phone apps and repeat Wi-Fi provisioning with BLE transport.");
        }
#endif
        if (rmaker_core_event_group) {
            /* Signal rmaker thread to continue execution */
            xEventGroupSetBits(rmaker_core_event_group, THREAD_SET_DNS_SEVER_EVENT);
        }
    } else
#endif /* CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD */
     if (event_base == RMAKER_EVENT &&
            (event_id == RMAKER_EVENT_USER_NODE_MAPPING_DONE ||
            event_id == RMAKER_EVENT_USER_NODE_MAPPING_RESET)) {
        esp_event_handler_unregister(RMAKER_EVENT, event_id, &esp_rmaker_event_handler);
        esp_rmaker_params_mqtt_init();
    } else if (event_base == RMAKER_COMMON_EVENT && event_id == RMAKER_MQTT_EVENT_CONNECTED) {
        if (rmaker_core_event_group) {
            /* Signal rmaker thread to continue execution */
            xEventGroupSetBits(rmaker_core_event_group, MQTT_CONNECTED_EVENT);
        }
    }
}

static esp_err_t esp_rmaker_deinit_priv_data(esp_rmaker_priv_data_t *rmaker_priv_data)
{
    if (!rmaker_priv_data) {
        return ESP_ERR_INVALID_ARG;
    }
    esp_rmaker_work_queue_deinit();
#ifndef CONFIG_ESP_RMAKER_DISABLE_USER_MAPPING_PROV
    esp_rmaker_user_mapping_prov_deinit();
#endif
#ifdef ESP_RMAKER_CLAIM_ENABLED
    if (rmaker_priv_data->claim_data) {
        esp_rmaker_claim_data_free(rmaker_priv_data->claim_data);
    }
#endif
    if (rmaker_priv_data->mqtt_conn_params) {
        esp_rmaker_clean_mqtt_conn_params(rmaker_priv_data->mqtt_conn_params);
        free(rmaker_priv_data->mqtt_conn_params);
    }
    if (rmaker_priv_data->node_id) {
        free(rmaker_priv_data->node_id);
    }
    free(rmaker_priv_data);
    return ESP_OK;
}

esp_err_t esp_rmaker_node_deinit(const esp_rmaker_node_t *node)
{
    if (!esp_rmaker_priv_data) {
        ESP_LOGE(TAG, "ESP RainMaker already de-initialized.");
        return ESP_ERR_INVALID_ARG;
    }

    if (esp_rmaker_priv_data->state != ESP_RMAKER_STATE_INIT_DONE) {
        ESP_LOGE(TAG, "ESP RainMaker is still running. Please stop it first.");
        return ESP_ERR_INVALID_STATE;
    }
    esp_rmaker_node_delete(node);
    esp_rmaker_priv_data->node = NULL;
    esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
    esp_rmaker_priv_data = NULL;
    return ESP_OK;
}

char *esp_rmaker_get_node_id(void)
{
    if (esp_rmaker_priv_data) {
        return esp_rmaker_priv_data->node_id;
    }
    return NULL;
}

static esp_err_t esp_rmaker_report_node_config_and_state()
{
    if (esp_rmaker_report_node_config() != ESP_OK) {
        ESP_LOGE(TAG, "Report node config failed.");
        return ESP_FAIL;
    }
    if (esp_rmaker_user_node_mapping_get_state() == ESP_RMAKER_USER_MAPPING_DONE) {
        if (esp_rmaker_report_node_state() != ESP_OK) {
            ESP_LOGE(TAG, "Report node state failed.");
            return ESP_FAIL;
        }
    }
    return ESP_OK;
}

static void __esp_rmaker_report_node_config_and_state(void *data)
{
    esp_rmaker_report_node_config_and_state();
}

esp_err_t esp_rmaker_report_node_details()
{
    return esp_rmaker_work_queue_add_task(__esp_rmaker_report_node_config_and_state, NULL);
}


static void esp_rmaker_task(void *data)
{
    ESP_RMAKER_CHECK_HANDLE();
    esp_rmaker_priv_data->state = ESP_RMAKER_STATE_STARTING;
    esp_err_t err = ESP_FAIL;
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
    wifi_ap_record_t ap_info;
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD)
    ip6_addr_t nat64_prefix;
#endif
    esp_rmaker_priv_data->mqtt_connected = false;
    esp_event_handler_register(RMAKER_COMMON_EVENT, RMAKER_MQTT_EVENT_CONNECTED, &esp_rmaker_mqtt_event_handler, NULL);
    esp_event_handler_register(RMAKER_COMMON_EVENT, RMAKER_MQTT_EVENT_DISCONNECTED, &esp_rmaker_mqtt_event_handler, NULL);
    rmaker_core_event_group = xEventGroupCreate();
    if (!rmaker_core_event_group) {
        ESP_LOGE(TAG, "Failed to create event group. Aborting");
        goto rmaker_end;
    }
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
    err = esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &esp_rmaker_event_handler, esp_rmaker_priv_data);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler. Error: %d. Aborting", err);
        goto rmaker_end;
    }
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD)
    err = esp_event_handler_register(OPENTHREAD_EVENT, OPENTHREAD_EVENT_SET_DNS_SERVER, &esp_rmaker_event_handler, esp_rmaker_priv_data);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler. Error: %d. Aborting", err);
        goto rmaker_end;
    }
#endif
    err = esp_event_handler_register(RMAKER_COMMON_EVENT, RMAKER_MQTT_EVENT_CONNECTED, &esp_rmaker_event_handler, esp_rmaker_priv_data);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to register event handler. Error: %d. Aborting", err);
        goto rmaker_end;
    }
    /* Assisted claiming needs to be done before Wi-Fi connection */
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
    if (esp_rmaker_priv_data->need_claim) {
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
        if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
            ESP_LOGE(TAG, "Node connected to Wi-Fi without Assisted claiming. Cannot proceed to MQTT connection.");
            ESP_LOGE(TAG, "Please update your phone apps and repeat Wi-Fi provisioning with BLE transport.");
            esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, &esp_rmaker_event_handler);
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD)
        if (esp_openthread_get_nat64_prefix(&nat64_prefix) == ESP_OK) {
            ESP_LOGE(TAG, "Node connected to Thread without Assisted claiming. Cannot proceed to MQTT connection.");
            ESP_LOGE(TAG, "Please update your phone apps and repeat Thread provisioning with BLE transport.");
            esp_event_handler_unregister(OPENTHREAD_EVENT, OPENTHREAD_EVENT_SET_DNS_SERVER, &esp_rmaker_event_handler);
#endif
            err = ESP_FAIL;
            goto rmaker_end;
        }
        esp_rmaker_post_event(RMAKER_EVENT_CLAIM_STARTED, NULL, 0);
        err = esp_rmaker_assisted_claim_perform(esp_rmaker_priv_data->claim_data);
        if (err != ESP_OK) {
            esp_rmaker_post_event(RMAKER_EVENT_CLAIM_FAILED, NULL, 0);
            ESP_LOGE(TAG, "esp_rmaker_self_claim_perform() returned %d. Aborting", err);
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
            esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, &esp_rmaker_event_handler);
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD)
            esp_event_handler_unregister(OPENTHREAD_EVENT, OPENTHREAD_EVENT_SET_DNS_SERVER, &esp_rmaker_event_handler);
#endif
            goto rmaker_end;
        }
        esp_rmaker_priv_data->claim_data = NULL;
        esp_rmaker_post_event(RMAKER_EVENT_CLAIM_SUCCESSFUL, NULL, 0);
    }
#endif /* CONFIG_ESP_RMAKER_ASSISTED_CLAIM */
#if defined(CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI)
    /* Check if already connected to Wi-Fi */
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        /* Wait for Wi-Fi connection */
        xEventGroupWaitBits(rmaker_core_event_group, WIFI_CONNECTED_EVENT, false, true, portMAX_DELAY);
    }
    esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, &esp_rmaker_event_handler);
#elif defined(CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD) /* CONFIG_ESP_RMAKER_NETWORK_OVER_WIFI */
    esp_openthread_lock_acquire(portMAX_DELAY);
    err = esp_openthread_get_nat64_prefix(&nat64_prefix);
    esp_openthread_lock_release();
    /* Check if already get nat64 prefix */
    if (err != ESP_OK) {
        /* Wait for Thread connection */
        xEventGroupWaitBits(rmaker_core_event_group, THREAD_SET_DNS_SEVER_EVENT, false, true, portMAX_DELAY);
        err = ESP_OK;
    }
    esp_event_handler_unregister(OPENTHREAD_EVENT, OPENTHREAD_EVENT_SET_DNS_SERVER, &esp_rmaker_event_handler);
#endif /* CONFIG_ESP_RMAKER_NETWORK_OVER_THREAD */

    if (esp_rmaker_priv_data->enable_time_sync) {
#ifdef CONFIG_MBEDTLS_HAVE_TIME_DATE
        esp_rmaker_time_wait_for_sync(portMAX_DELAY);
#endif
    }
    /* Self claiming can be done only after Wi-Fi connection */
#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM
    if (esp_rmaker_priv_data->need_claim) {
        esp_rmaker_post_event(RMAKER_EVENT_CLAIM_STARTED, NULL, 0);
        err = esp_rmaker_self_claim_perform(esp_rmaker_priv_data->claim_data);
        if (err != ESP_OK) {
            esp_rmaker_post_event(RMAKER_EVENT_CLAIM_FAILED, NULL, 0);
            ESP_LOGE(TAG, "esp_rmaker_self_claim_perform() returned %d. Aborting", err);
            goto rmaker_end;
        }
        esp_rmaker_priv_data->claim_data = NULL;
        esp_rmaker_post_event(RMAKER_EVENT_CLAIM_SUCCESSFUL, NULL, 0);
    }
#endif
#ifdef ESP_RMAKER_CLAIM_ENABLED
    if (esp_rmaker_priv_data->need_claim) {
        esp_rmaker_priv_data->mqtt_conn_params = esp_rmaker_get_mqtt_conn_params();
        if (!esp_rmaker_priv_data->mqtt_conn_params) {
            ESP_LOGE(TAG, "Failed to initialise MQTT Config after claiming. Aborting");
            err = ESP_FAIL;
            goto rmaker_end;
        }
        err = esp_rmaker_mqtt_init(esp_rmaker_priv_data->mqtt_conn_params);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "esp_rmaker_mqtt_init() returned %d. Aborting", err);
            goto rmaker_end;
        }
        esp_rmaker_priv_data->need_claim = false;
    }
#endif /* ESP_RMAKER_CLAIM_ENABLED */
#ifdef CONFIG_ESP_RMAKER_CMD_RESP_ENABLE
        err = esp_rmaker_cmd_response_enable();
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Failed to enable Command - Response module. Aborting!!!");
            goto rmaker_end;
        }
        esp_rmaker_node_add_attribute(esp_rmaker_get_node(), "cmd-resp", "1");
#else
    ESP_LOGW(TAG, "Command-Response Module not enabled. Set CONFIG_ESP_RMAKER_CMD_RESP_ENABLE=y to use it.");
#endif /* !CONFIG_ESP_RMAKER_CMD_RESP_ENABLE */
#ifdef CONFIG_ESP_RMAKER_LOCAL_CTRL_ENABLE
    err = esp_rmaker_local_ctrl_enable();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start local control service. Aborting!!!");
        goto rmaker_end;
    }
#endif /* CONFIG_ESP_RMAKER_LOCAL_CTRL_ENABLE */
    err = esp_rmaker_mqtt_connect();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_rmaker_mqtt_connect() returned %d. Aborting", err);
        goto rmaker_end;
    }
    ESP_LOGI(TAG, "Waiting for MQTT connection");
    xEventGroupWaitBits(rmaker_core_event_group, MQTT_CONNECTED_EVENT, false, true, portMAX_DELAY);
    esp_event_handler_unregister(RMAKER_COMMON_EVENT, RMAKER_MQTT_EVENT_CONNECTED, &esp_rmaker_event_handler);
    esp_rmaker_priv_data->state = ESP_RMAKER_STATE_STARTED;
    err = esp_rmaker_report_node_config();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Aborting!!!");
        goto rmaker_end;
    }
    if (esp_rmaker_user_node_mapping_get_state() == ESP_RMAKER_USER_MAPPING_DONE) {
        err = esp_rmaker_params_mqtt_init();
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Aborting!!!");
            goto rmaker_end;
        }
    } else {
        /* If network is connected without even starting the user-node mapping workflow,
         * it could mean that some incorrect app was used to provision the device. Even
         * if the older user would not be able to update the params, it would be better
         * to completely reset the user permissions by sending a dummy user node mapping
         * request, so that the earlier user won't even see the connectivity and other
         * status.
         */
        if (esp_rmaker_user_node_mapping_get_state() != ESP_RMAKER_USER_MAPPING_STARTED) {
            esp_rmaker_reset_user_node_mapping();
            /* Wait for user reset to finish. */
            err = esp_event_handler_register(RMAKER_EVENT, RMAKER_EVENT_USER_NODE_MAPPING_RESET,
                    &esp_rmaker_event_handler, NULL);
        } else {
            /* Wait for User Node mapping to finish. */
            err = esp_event_handler_register(RMAKER_EVENT, RMAKER_EVENT_USER_NODE_MAPPING_DONE,
                    &esp_rmaker_event_handler, NULL);
        }
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Aborting!!!");
            goto rmaker_end;
        }
        ESP_LOGI(TAG, "Waiting for User Node Association.");
    }
    err = ESP_OK;

