rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_core.c
rmaker_end:
    if (rmaker_core_event_group) {
        vEventGroupDelete(rmaker_core_event_group);
    }
    rmaker_core_event_group = NULL;
    if (err == ESP_OK) {
        return;
    }
    if (esp_rmaker_priv_data->mqtt_connected) {
        esp_rmaker_mqtt_disconnect();
    }
    esp_rmaker_priv_data->state = ESP_RMAKER_STATE_INIT_DONE;
}


static esp_err_t esp_rmaker_mqtt_conn_params_init(esp_rmaker_priv_data_t *rmaker_priv_data, bool use_claiming)
{
    rmaker_priv_data->mqtt_conn_params = esp_rmaker_get_mqtt_conn_params();
    if (rmaker_priv_data->mqtt_conn_params) {
        return ESP_OK;
    }
#ifdef ESP_RMAKER_CLAIM_ENABLED
    if (use_claiming) {
#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM
        rmaker_priv_data->claim_data = esp_rmaker_self_claim_init();
#endif
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
        rmaker_priv_data->claim_data = esp_rmaker_assisted_claim_init();
#endif
        if (!rmaker_priv_data->claim_data) {
            ESP_LOGE(TAG, "Failed to initialise Claiming.");
            return ESP_FAIL;
        } else {
            rmaker_priv_data->need_claim = true;
            return ESP_OK;
        }
    }
#endif /* ESP_RMAKER_CLAIM_ENABLED */
    return ESP_FAIL;
}
/* Initialize ESP RainMaker */
static esp_err_t esp_rmaker_init(const esp_rmaker_config_t *config, bool use_claiming)
{
    if (esp_rmaker_priv_data) {
        ESP_LOGE(TAG, "ESP RainMaker already initialised");
        return ESP_ERR_INVALID_STATE;
    }
    if (!config) {
        ESP_LOGE(TAG, "RainMaker config missing. Cannot initialise");
        return ESP_ERR_INVALID_ARG;
    }
    if (esp_rmaker_factory_init() != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialise storage");
        return ESP_FAIL;
    }
    esp_rmaker_priv_data = MEM_CALLOC_EXTRAM(1, sizeof(esp_rmaker_priv_data_t));
    if (!esp_rmaker_priv_data) {
        ESP_LOGE(TAG, "Failed to allocate memory");
        return ESP_ERR_NO_MEM;
    }

    esp_rmaker_priv_data->node_id = esp_rmaker_populate_node_id(use_claiming);
    if (!esp_rmaker_priv_data->node_id) {
        esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
        esp_rmaker_priv_data = NULL;
        ESP_LOGE(TAG, "Failed to initialise Node Id. Please perform \"claiming\" using RainMaker CLI.");
        return ESP_ERR_NO_MEM;
    }

    if (esp_rmaker_work_queue_init() != ESP_OK) {
        esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
        esp_rmaker_priv_data = NULL;
        ESP_LOGE(TAG, "ESP RainMaker Queue Creation Failed");
        return ESP_ERR_NO_MEM;
    }
#ifndef CONFIG_ESP_RMAKER_DISABLE_USER_MAPPING_PROV
    if (esp_rmaker_user_mapping_prov_init()) {
        esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
        esp_rmaker_priv_data = NULL;
        ESP_LOGE(TAG, "Could not initialise User-Node mapping.");
        return ESP_FAIL;
    }
#endif /* !CONFIG_ESP_RMAKER_DISABLE_USER_MAPPING_PROV */
    if (esp_rmaker_mqtt_conn_params_init(esp_rmaker_priv_data, use_claiming) != ESP_OK) {
        esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
        esp_rmaker_priv_data = NULL;
        ESP_LOGE(TAG, "Failed to initialise MQTT Params. Please perform \"claiming\" using RainMaker CLI.");
        return ESP_FAIL;
    } else {
#ifdef ESP_RMAKER_CLAIM_ENABLED
        if (!esp_rmaker_priv_data->need_claim)
#endif /* ESP_RMAKER_CLAIM_ENABLED */
        {
            if (esp_rmaker_mqtt_init(esp_rmaker_priv_data->mqtt_conn_params) != ESP_OK) {
                esp_rmaker_deinit_priv_data(esp_rmaker_priv_data);
                esp_rmaker_priv_data = NULL;
                ESP_LOGE(TAG, "Failed to initialise MQTT");
                return ESP_FAIL;
            }
        }
    }
    esp_rmaker_user_node_mapping_init();
#ifdef CONFIG_ESP_RMAKER_LOCAL_CTRL_ENABLE
    esp_rmaker_init_local_ctrl_service();
#endif
    esp_rmaker_priv_data->enable_time_sync = config->enable_time_sync;
    esp_rmaker_post_event(RMAKER_EVENT_INIT_DONE, NULL, 0);
    esp_rmaker_priv_data->state = ESP_RMAKER_STATE_INIT_DONE;

    /* Adding the RainMaker Task to the queue so that it is will be the first function
     * to be executed when the Work Queue task begins.
     */
    esp_rmaker_work_queue_add_task(esp_rmaker_task, NULL);
    return ESP_OK;
}

static esp_err_t esp_rmaker_register_node(const esp_rmaker_node_t *node)
{
    ESP_RMAKER_CHECK_HANDLE(ESP_ERR_INVALID_STATE);
    if (esp_rmaker_priv_data->node) {
        ESP_LOGE(TAG, "A node has already been registered. Cannot register another.");
        return ESP_ERR_INVALID_STATE;
    }
    if (!node) {
        ESP_LOGE(TAG, "Node handle cannot be NULL.");
        return ESP_ERR_INVALID_ARG;
    }
    esp_rmaker_priv_data->node = node;
    return ESP_OK;
}

esp_rmaker_node_t *esp_rmaker_node_init(const esp_rmaker_config_t *config, const char *name, const char *type)
{
    esp_err_t err = esp_rmaker_init(config, true);
    if (err != ESP_OK) {
        return NULL;
    }
    esp_rmaker_node_t *node = esp_rmaker_node_create(name, type);
    if (!node) {
        ESP_LOGE(TAG, "Failed to create node");
        return NULL;
    }
    err = esp_rmaker_register_node(node);
    if (err != ESP_OK) {
        free(node);
        return NULL;
    }
    return node;
}

const esp_rmaker_node_t *esp_rmaker_get_node()
{
    ESP_RMAKER_CHECK_HANDLE(NULL);
    return esp_rmaker_priv_data->node;
}

/* Start the ESP RainMaker Core Task */
esp_err_t esp_rmaker_start(void)
{
    ESP_RMAKER_CHECK_HANDLE(ESP_ERR_INVALID_STATE);
    if (esp_rmaker_priv_data->enable_time_sync) {
        esp_rmaker_time_sync_init(NULL);
    }
    ESP_LOGI(TAG, "Starting RainMaker Work Queue task");
    if (esp_rmaker_work_queue_start() != ESP_OK) {
        ESP_LOGE(TAG, "Couldn't create RainMaker Work Queue task");
        return ESP_FAIL;
    }
    ESP_ERROR_CHECK(esp_event_handler_register(RMAKER_COMMON_EVENT, ESP_EVENT_ANY_ID, &reset_event_handler, NULL));
    return ESP_OK;
}

esp_err_t esp_rmaker_stop()
{
    ESP_RMAKER_CHECK_HANDLE(ESP_ERR_INVALID_STATE);
    esp_rmaker_priv_data->state = ESP_RMAKER_STATE_STOP_REQUESTED;
    return ESP_OK;
}
